Repository: xcv58/MacTools
Catalog: Plugins/ClipboardHistory/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# panel.selection.action
source: 选择多个项目
ar: تحديد عناصر متعددة
de: Mehrere Einträge auswählen
en: Select Multiple Items
es: Seleccionar varios elementos
fr: Sélectionner plusieurs éléments
ja: 複数項目を選択
ko: 여러 항목 선택
pt: Selecionar vários itens
ru: Выбрать несколько элементов
tr: Birden Fazla Öğe Seç
zh_hant: 選取多個項目

# panel.selection.add
source: 添加到所选项目
ar: إضافة إلى التحديد
de: Zur Auswahl hinzufügen
en: Add to Selection
es: Añadir a la selección
fr: Ajouter à la sélection
ja: 選択に追加
ko: 선택 항목에 추가
pt: Adicionar à seleção
ru: Добавить к выбранному
tr: Seçime Ekle
zh_hant: 加入所選項目

# panel.selection.count
source: 已选择 %lld 项
ar: تم تحديد %lld
de: %lld ausgewählt
en: %lld selected
es: %lld seleccionados
fr: %lld sélectionnés
ja: %lld件選択
ko: %lld개 선택됨
pt: %lld selecionados
ru: Выбрано: %lld
tr: %lld seçili
zh_hant: 已選取 %lld 項

# panel.selection.remove
source: 从所选项目中移除
ar: إزالة من التحديد
de: Aus Auswahl entfernen
en: Remove from Selection
es: Quitar de la selección
fr: Retirer de la sélection
ja: 選択から削除
ko: 선택 항목에서 제거
pt: Remover da seleção
ru: Убрать из выбранного
tr: Seçimden Çıkar
zh_hant: 從所選項目移除

# panel.shortcuts.cycleScope
source: 切换范围
ar: تبديل النطاق
de: Bereich wechseln
en: Switch Scope
es: Cambiar ámbito
fr: Changer de portée
ja: 範囲を切り替え
ko: 범위 전환
pt: Alternar escopo
ru: Сменить область
tr: Kapsamı Değiştir
zh_hant: 切換範圍

# panel.shortcuts.cycleScope.description
source: 切换全部、历史和片段；加按 Shift 可反向切换。Control-1 至 Control-3 可直接选择范围。
ar: التبديل بين الكل والسجل والمقتطفات؛ أضف Shift للرجوع. استخدم Control-1 إلى Control-3 لاختيار النطاق مباشرةً.
de: Zwischen Alle, Verlauf und Textbausteine wechseln; mit Umschalt rückwärts. Control-1 bis Control-3 wählt den Bereich direkt.
en: Switch between All, History, and Snippets; add Shift to go backward. Control-1 through Control-3 selects a scope directly.
es: Cambia entre Todo, Historial y Fragmentos; añade Mayúsculas para retroceder. Control-1 a Control-3 selecciona un ámbito directamente.
fr: Parcourir Tout, Historique et Extraits ; ajouter Maj pour revenir en arrière. Contrôle-1 à Contrôle-3 sélectionne directement une portée.
ja: すべて、履歴、スニペットを切り替えます。Shift を加えると逆方向になります。Control-1〜Control-3 で範囲を直接選択します。
ko: 전체, 기록, 스니펫을 전환합니다. Shift를 추가하면 반대 방향으로 전환합니다. Control-1부터 Control-3까지 눌러 범위를 직접 선택합니다.
pt: Alterna entre Tudo, Histórico e Trechos; adicione Shift para voltar. Control-1 a Control-3 seleciona um escopo diretamente.
ru: Переключение между всеми элементами, историей и фрагментами; добавьте Shift для обратного порядка. Control-1–Control-3 выбирает область напрямую.
tr: Tümü, Geçmiş ve Parçacıklar arasında geçiş yapın; geriye gitmek için Shift tuşunu ekleyin. Control-1'den Control-3'e kadar olan tuşlar doğrudan bir kapsam seçer.
zh_hant: 切換全部、歷史和片段；加按 Shift 可反向切換。Control-1 至 Control-3 可直接選擇範圍。

# panel.shortcuts.cycleScope.shiftReserved
source: Shift 保留用于反向切换。请录制不含 Shift 的正向快捷键。
ar: Shift محجوز للتنقل للخلف. سجّل اختصار التنقل للأمام من دون Shift.
de: Die Umschalttaste ist für das Rückwärtswechseln reserviert. Zeichne den Vorwärtskurzbefehl ohne Umschalttaste auf.
en: Shift is reserved for cycling backward. Record the forward shortcut without Shift.
es: Mayúsculas está reservado para retroceder. Graba el atajo de avance sin Mayúsculas.
fr: Maj est réservé au parcours inverse. Enregistrez le raccourci suivant sans Maj.
ja: Shift は逆方向の切り替え用に予約されています。順方向のショートカットは Shift なしで記録してください。
ko: Shift는 뒤로 순환하는 데 사용됩니다. 앞으로 순환할 단축키는 Shift 없이 기록하십시오.
pt: Shift é reservado para alternar para trás. Grave o atalho para avançar sem Shift.
ru: Shift зарезервирован для обратного переключения. Запишите сочетание для переключения вперёд без Shift.
tr: Shift, geriye geçiş için ayrılmıştır. İleri kısayolu Shift olmadan kaydedin.
zh_hant: Shift 保留用於反向切換。請錄製不含 Shift 的正向快速鍵。

# panel.shortcuts.fixedConflict
source: 剪贴板窗口已将此按键用于“%@”。
ar: يستخدم اختصار لوحة الحافظة هذا المفتاح من أجل %@.
de: Dieses Tastenkürzel wird im Zwischenablagefenster für %@ verwendet.
en: This key is used by the Clipboard window for %@.
es: La ventana del portapapeles usa esta tecla para %@.
fr: Cette touche est utilisée par la fenêtre Presse-papiers pour %@.
ja: このキーはクリップボードウインドウで「%@」に使用されています。
ko: 이 키는 클립보드 윈도우에서 %@에 사용됩니다.
pt: Esta tecla é usada pela janela da área de transferência para %@.
ru: Эта клавиша используется в окне буфера обмена для действия «%@».
tr: Bu tuş, Pano penceresi tarafından “%@” için kullanılıyor.
zh_hant: 剪貼板視窗已將此按鍵用於「%@」。

# panel.shortcuts.quickPaste
source: 快速粘贴
ar: لصق سريع
de: Schnell einfügen
en: Quick Paste
es: Pegado rápido
fr: Collage rapide
ja: クイックペースト
ko: 빠른 붙여넣기
pt: Colagem rápida
ru: Быстрая вставка
tr: Hızlı Yapıştırma
zh_hant: 快速貼上

# panel.shortcuts.reverseCycleConflict
source: 此按键由“%@”保留用于反向切换筛选条件。
ar: هذا المفتاح محجوز للتنقل بين عوامل التصفية للخلف بواسطة %@.
de: Diese Taste ist durch %@ für das Rückwärtswechseln der Filter reserviert.
en: This key is reserved for cycling filters backward by %@.
es: Esta tecla está reservada por %@ para recorrer los filtros hacia atrás.
fr: Cette touche est réservée par %@ pour parcourir les filtres en sens inverse.
ja: このキーは「%@」によるフィルタの逆方向切り替え用に予約されています。
ko: 이 키는 %@의 필터 뒤로 전환에 사용됩니다.
pt: Esta tecla é reservada por %@ para alternar os filtros para trás.
ru: Эта клавиша зарезервирована действием «%@» для обратного переключения фильтров.
tr: Bu tuş, “%@” tarafından filtreleri geriye çevirmek için ayrılmıştır.
zh_hant: 此按鍵由「%@」保留用於反向切換篩選條件。

# panel.shortcuts.actions
source: 显示或隐藏操作
ar: إظهار الإجراءات أو إخفاؤها
de: Aktionen ein-/ausblenden
en: Toggle Actions
es: Mostrar u ocultar acciones
fr: Afficher ou masquer les actions
ja: アクションの表示を切り替える
ko: 동작 표시 전환
pt: Mostrar ou ocultar ações
ru: Показать или скрыть действия
tr: Eylemleri Aç/Kapat
zh_hant: 顯示或隱藏操作

# panel.shortcuts.actions.description
source: 打开操作，或关闭并返回历史搜索。
ar: افتح الإجراءات أو أغلقها للعودة إلى البحث في السجل.
de: Aktionen öffnen oder schließen und zur Verlaufssuche zurückkehren.
en: Open Actions or close it and return to the history search.
es: Abre Acciones o ciérralo para volver a buscar en el historial.
fr: Ouvrez les actions ou fermez-les pour revenir à la recherche dans l’historique.
ja: アクションを開くか、閉じて履歴検索に戻ります。
ko: 동작을 열거나 닫고 기록 검색으로 돌아갑니다.
pt: Abra Ações ou feche para voltar à pesquisa no histórico.
ru: Откройте действия или закройте их, чтобы вернуться к поиску в истории.
tr: Eylemler'i açar ya da kapatıp geçmiş aramasına döner.
zh_hant: 開啟操作，或關閉並返回歷史搜尋。

# panel.shortcuts.toggleSelection.description
source: 多选模式下，即使焦点在搜索框，也可勾选或取消勾选高亮项目。
ar: في وضع التحديد المتعدد، حدد العنصر المميز أو ألغِ تحديده، حتى أثناء التركيز على حقل البحث.
de: Im Mehrfachauswahlmodus das hervorgehobene Objekt auswählen oder abwählen, auch wenn das Suchfeld fokussiert ist.
en: In multi-select mode, select or unselect the highlighted item, even while the search field is focused.
es: En selección múltiple, marca o desmarca el elemento resaltado incluso con el campo de búsqueda enfocado.
fr: En sélection multiple, cochez ou décochez l’élément en surbrillance, même lorsque le champ de recherche est actif.
ja: 複数選択モードで、検索欄にフォーカスがある場合も強調表示された項目の選択を切り替えます。
ko: 다중 선택 모드에서 검색 필드에 포커스가 있어도 강조 표시된 항목을 선택하거나 선택 해제합니다.
pt: No modo de seleção múltipla, marque ou desmarque o item destacado mesmo com o campo de pesquisa em foco.
ru: В режиме множественного выбора отметьте выделенный элемент или снимите отметку, даже если фокус находится в поле поиска.
tr: Çoklu seçim modunda, arama alanı odaktayken bile vurgulanan öğeyi seçer veya seçimini kaldırır.
zh_hant: 多選模式下，即使焦點在搜尋框，也可勾選或取消勾選反白項目。

# panel.shortcuts.change
source: 更改快捷键…
ar: تغيير الاختصار…
de: Kurzbefehl ändern …
en: Change Shortcut…
es: Cambiar atajo…
fr: Modifier le raccourci…
ja: ショートカットを変更…
ko: 단축키 변경…
pt: Alterar atalho…
ru: Изменить сочетание клавиш…
tr: Kısayolu Değiştir…
zh_hant: 更改快速鍵…

# panel.shortcuts.chooseFilter
source: 选择筛选条件
ar: اختيار عامل تصفية
de: Filter auswählen
en: Choose Filter
es: Elegir filtro
fr: Choisir un filtre
ja: フィルタを選択
ko: 필터 선택
pt: Escolher filtro
ru: Выбрать фильтр
tr: Filtre Seç
zh_hant: 選擇篩選條件

# panel.shortcuts.copyCombined
source: 合并复制所选项目
ar: نسخ التحديد المدمج
de: Kombinierte Auswahl kopieren
en: Copy Combined Selection
es: Copiar selección combinada
fr: Copier la sélection combinée
ja: 選択項目をまとめてコピー
ko: 선택 항목 함께 복사
pt: Copiar seleção combinada
ru: Копировать выбранное вместе
tr: Seçimi Birleştirerek Kopyala
zh_hant: 合併拷貝所選項目

# panel.shortcuts.copyCombined.description
source: 按选择顺序合并复制所选项目。
ar: انسخ العناصر المحددة معًا بترتيب تحديدها.
de: Ausgewählte Einträge gemeinsam in Auswahlreihenfolge kopieren.
en: Copy selected entries together in their selected order.
es: Copia juntas las entradas seleccionadas en el orden elegido.
fr: Copier ensemble les éléments dans l’ordre de sélection.
ja: 選択した項目を選択順にまとめてコピーします。
ko: 선택한 항목을 선택 순서대로 함께 복사합니다.
pt: Copie em conjunto os itens pela ordem selecionada.
ru: Копировать выбранные элементы вместе в порядке выбора.
tr: Seçili kayıtları seçim sırasına göre birlikte kopyalar.
zh_hant: 依選取順序合併拷貝所選項目。

# panel.shortcuts.delete
source: 删除项目
ar: حذف العنصر
de: Element löschen
en: Delete Item
es: Eliminar elemento
fr: Supprimer l’élément
ja: 項目を削除
ko: 항목 삭제
pt: Excluir item
ru: Удалить элемент
tr: Öğeyi Sil
zh_hant: 刪除項目

# panel.shortcuts.delete.description
source: 删除当前剪贴板项目，且不与文本编辑冲突。
ar: احذف عنصر الحافظة المحدد دون التعارض مع تحرير النص.
de: Das fokussierte Zwischenablageelement ohne Konflikt mit der Textbearbeitung löschen.
en: Delete the focused clipboard item without conflicting with text editing.
es: Elimina el elemento enfocado sin interferir con la edición de texto.
fr: Supprimer l’élément actif sans conflit avec l’édition de texte.
ja: テキスト編集と競合せずに選択中の項目を削除します。
ko: 텍스트 편집과 충돌하지 않고 현재 항목을 삭제합니다.
pt: Elimine o item em foco sem interferir com a edição de texto.
ru: Удалить выбранный элемент без конфликта с редактированием текста.
tr: Odaktaki pano öğesini, metin düzenlemeyle çakışmadan siler.
zh_hant: 刪除目前剪貼簿項目，且不與文字編輯衝突。

# panel.shortcuts.export
source: 导出
ar: تصدير
de: Exportieren
en: Export
es: Exportar
fr: Exporter
ja: 書き出す
ko: 내보내기
pt: Exportar
ru: Экспорт
tr: Dışa Aktar
zh_hant: 輸出

# panel.shortcuts.export.description
source: 打开当前剪贴板项目的导出格式。
ar: افتح تنسيقات التصدير لعنصر الحافظة المحدد.
de: Exportformate für das fokussierte Zwischenablageelement öffnen.
en: Open export formats for the focused clipboard item.
es: Abre los formatos de exportación del elemento enfocado.
fr: Ouvrir les formats d’exportation pour l’élément actif.
ja: 選択中の項目で利用できる書き出し形式を開きます。
ko: 현재 클립보드 항목의 내보내기 형식을 엽니다.
pt: Abra os formatos de exportação do item em foco.
ru: Открыть форматы экспорта для выбранного элемента.
tr: Odaktaki pano öğesi için dışa aktarma biçimlerini açar.
zh_hant: 開啟目前剪貼簿項目的輸出格式。

# panel.shortcuts.group
source: 剪贴板窗口快捷键
ar: اختصارات نافذة الحافظة
de: Kurzbefehle im Zwischenablagefenster
en: Clipboard Window Shortcuts
es: Atajos de la ventana del portapapeles
fr: Raccourcis de la fenêtre du presse-papiers
ja: クリップボードウインドウのショートカット
ko: 클립보드 윈도우 단축키
pt: Atalhos da janela da área de transferência
ru: Сочетания клавиш окна буфера
tr: Pano Penceresi Kısayolları
zh_hant: 剪貼簿視窗快速鍵

# panel.shortcuts.group.description
source: 这些快捷键仅在剪贴板窗口聚焦时生效。
ar: تعمل هذه الاختصارات فقط عند التركيز على نافذة الحافظة.
de: Diese Kurzbefehle funktionieren nur bei fokussiertem Zwischenablagefenster.
en: These shortcuts work only while the Clipboard window is focused.
es: Estos atajos solo funcionan cuando la ventana del portapapeles está enfocada.
fr: Ces raccourcis fonctionnent uniquement lorsque la fenêtre du presse-papiers est active.
ja: クリップボードウインドウにフォーカス中のみ機能します。
ko: 클립보드 윈도우에 포커스된 동안에만 작동합니다.
pt: Estes atalhos só funcionam quando a janela da Área de Transferência está em foco.
ru: Эти сочетания работают только при активном окне буфера обмена.
tr: Bu kısayollar yalnızca Pano penceresi odaktayken çalışır.
zh_hant: 這些快速鍵僅在剪貼簿視窗聚焦時生效。

# panel.shortcuts.multiSelect
source: 选择多个项目
ar: تحديد عناصر متعددة
de: Mehrere Elemente auswählen
en: Select Multiple Items
es: Seleccionar varios elementos
fr: Sélectionner plusieurs éléments
ja: 複数項目を選択
ko: 여러 항목 선택
pt: Selecionar vários itens
ru: Выбрать несколько элементов
tr: Birden Fazla Öğe Seç
zh_hant: 選取多個項目

# panel.shortcuts.multiSelect.description
source: 进入或退出多选模式。
ar: ادخل وضع التحديد المتعدد أو اخرج منه.
de: Mehrfachauswahl starten oder beenden.
en: Enter or leave multiple-selection mode.
es: Entra o sal del modo de selección múltiple.
fr: Activer ou quitter le mode de sélection multiple.
ja: 複数選択モードを開始または終了します。
ko: 다중 선택 모드를 시작하거나 종료합니다.
pt: Entre ou saia do modo de seleção múltipla.
ru: Войти в режим множественного выбора или выйти из него.
tr: Çoklu seçim moduna girer veya bu moddan çıkar.
zh_hant: 進入或離開多選模式。

# panel.shortcuts.pasteCombined
source: 合并粘贴所选项目
ar: لصق التحديد المدمج
de: Kombinierte Auswahl einsetzen
en: Paste Combined Selection
es: Pegar selección combinada
fr: Coller la sélection combinée
ja: 選択項目をまとめてペースト
ko: 선택 항목 함께 붙여넣기
pt: Colar seleção combinada
ru: Вставить выбранное вместе
tr: Seçimi Birleştirerek Yapıştır
zh_hant: 合併貼上所選項目

# panel.shortcuts.pasteCombined.description
source: 按选择顺序合并粘贴所选项目。
ar: الصق العناصر المحددة معًا بترتيب تحديدها.
de: Ausgewählte Einträge gemeinsam in Auswahlreihenfolge einsetzen.
en: Paste selected entries together in their selected order.
es: Pega juntas las entradas seleccionadas en el orden elegido.
fr: Coller ensemble les éléments dans l’ordre de sélection.
ja: 選択した項目を選択順にまとめてペーストします。
ko: 선택한 항목을 선택 순서대로 함께 붙여넣습니다.
pt: Cole em conjunto os itens pela ordem selecionada.
ru: Вставить выбранные элементы вместе в порядке выбора.
tr: Seçili kayıtları seçim sırasına göre birlikte yapıştırır.
zh_hant: 依選取順序合併貼上所選項目。

# panel.shortcuts.save
source: 保存或取消保存片段
ar: حفظ في المكتبة
de: In Bibliothek sichern
en: Save or Unsave Clip
es: Guardar en la biblioteca
fr: Enregistrer dans la bibliothèque
ja: ライブラリに保存
ko: 보관함에 저장
pt: Salvar na biblioteca
ru: Сохранить в библиотеку
tr: Öğeyi Kaydet veya Kaydı Kaldır
zh_hant: 儲存或取消儲存剪輯

# panel.shortcuts.save.description
source: 切换当前已捕获项目是否保存在“已存”中。
ar: الاحتفاظ بنسخة دائمة من عنصر السجل المحدد ضمن المحفوظات.
de: Eine dauerhafte Kopie des ausgewählten Verlaufsobjekts unter Gespeichert behalten.
en: Toggle whether the focused captured item is kept in Saved.
es: Conserva una copia permanente del elemento de historial seleccionado en Guardado.
fr: Conserver une copie durable de l’élément d’historique sélectionné dans Enregistré.
ja: 選択中の履歴項目を保存済みに永続的に保管します。
ko: 선택한 기록 항목을 저장됨에 영구 보관합니다.
pt: Mantenha uma cópia permanente do item de histórico selecionado em Salvos.
ru: Сохранить постоянную копию выбранного элемента истории.
tr: Odaktaki yakalanan öğenin “Kayıtlı”da tutulup tutulmayacağını değiştirir.
zh_hant: 切換目前已擷取項目是否保存在「已儲存」中。

# panel.shortcuts.share
source: 共享
ar: مشاركة
de: Teilen
en: Share
es: Compartir
fr: Partager
ja: 共有
ko: 공유
pt: Compartilhar
ru: Поделиться
tr: Paylaş
zh_hant: 分享

# panel.shortcuts.share.description
source: 为当前项目或所选内容打开 macOS 共享表单。
ar: افتح ورقة المشاركة في macOS للعنصر أو التحديد الحالي.
de: Das macOS-Teilen-Menü für das aktuelle Element oder die Auswahl öffnen.
en: Open the macOS share sheet for the current item or selection.
es: Abre la hoja para compartir de macOS para el elemento o la selección actual.
fr: Ouvrir la feuille de partage macOS pour l’élément ou la sélection actuelle.
ja: 現在の項目または選択内容をmacOSの共有シートで開きます。
ko: 현재 항목 또는 선택 항목의 macOS 공유 시트를 엽니다.
pt: Abra a folha de partilha do macOS para o item ou seleção atual.
ru: Открыть меню «Поделиться» macOS для текущего элемента или выбора.
tr: Geçerli öğe veya seçim için macOS paylaşım sayfasını açar.
zh_hant: 為目前項目或所選內容開啟 macOS 分享表單。

# saved.create
source: 新建片段
ar: مقتطف جديد
de: Neuer Textbaustein
en: New Snippet
es: Nuevo fragmento
fr: Nouvel extrait
ja: 新規スニペット
ko: 새 스니펫
pt: Novo trecho
ru: Новый фрагмент
tr: Yeni Parçacık
zh_hant: 新增片段

# saved.edit
source: 编辑片段
ar: تحرير المقتطف
de: Textbaustein bearbeiten
en: Edit Snippet
es: Editar fragmento
fr: Modifier l’extrait
ja: スニペットを編集
ko: 스니펫 편집
pt: Editar trecho
ru: Изменить фрагмент
tr: Parçacığı Düzenle
zh_hant: 編輯片段

# saved.editDetails
source: 编辑详细信息
ar: تحرير التفاصيل
de: Details bearbeiten
en: Edit Details
es: Editar detalles
fr: Modifier les détails
ja: 詳細を編集
ko: 세부사항 편집
pt: Editar detalhes
ru: Изменить сведения
tr: Ayrıntıları Düzenle
zh_hant: 編輯詳細資訊

# saved.editor.edit
source: 编辑片段
ar: تحرير المقتطف
de: Textbaustein bearbeiten
en: Edit Snippet
es: Editar fragmento
fr: Modifier l’extrait
ja: スニペットを編集
ko: 스니펫 편집
pt: Editar trecho
ru: Изменить фрагмент
tr: Parçacığı Düzenle
zh_hant: 編輯片段

# saved.editor.keyword
source: 展开关键词（可选）
ar: كلمة التوسيع (اختياري)
de: Kürzel (optional)
en: Expansion keyword (optional)
es: Palabra clave de expansión (opcional)
fr: Mot-clé d’expansion (facultatif)
ja: 展開キーワード（任意）
ko: 확장 키워드(선택 사항)
pt: Palavra-chave de expansão (opcional)
ru: Ключевое слово для подстановки (необязательно)
tr: Genişletme anahtar sözcüğü (isteğe bağlı)
zh_hant: 展開關鍵字（可選）

# saved.editor.keywordHint
source: 在支持的编辑器中，唯一关键词会在输入完成时展开；若它是另一关键词的前缀，则等待空格。需要辅助功能权限。
ar: تتوسع الكلمات الفريدة أثناء الكتابة في المحررات المدعومة. إذا كانت الكلمة بادئة لأخرى، فاضغط على المسافة. يتطلب إذن تسهيلات الاستخدام.
de: Eindeutige Kürzel werden in unterstützten Editoren beim Tippen erweitert. Beginnt ein anderes Kürzel damit, warte auf die Leertaste. Bedienungshilfen-Berechtigung erforderlich.
en: Unique keywords expand as you type in supported editors. Keywords that prefix another keyword wait for Space. Requires Accessibility permission.
es: Las palabras clave únicas se expanden al escribir en editores compatibles. Si son prefijo de otra, esperan a Espacio. Requiere permiso de Accesibilidad.
fr: Les mots-clés uniques se développent à la saisie dans les éditeurs compatibles. Ceux qui commencent un autre mot-clé attendent Espace. Autorisation Accessibilité requise.
ja: 対応エディタでは固有のキーワードを入力すると展開されます。別のキーワードの先頭と一致する場合はスペースキーで展開します。アクセシビリティ権限が必要です。
ko: 지원되는 편집기에서 고유한 키워드를 입력하면 확장됩니다. 다른 키워드의 접두사인 경우 스페이스를 기다립니다. 손쉬운 사용 권한이 필요합니다.
pt: As palavras-chave únicas expandem-se ao escrever em editores compatíveis. As que são prefixo de outra aguardam Espaço. Requer permissão de Acessibilidade.
ru: Уникальные ключевые слова раскрываются при вводе в поддерживаемых редакторах. Префиксы других слов ожидают пробела. Требуется Универсальный доступ.
tr: Benzersiz anahtar sözcükler, desteklenen düzenleyicilerde siz yazarken genişletilir. Başka bir anahtar sözcüğün başlangıcı olanlar Space tuşunu bekler. Erişilebilirlik izni gerektirir.
zh_hant: 在支援的編輯器中，唯一關鍵字會在輸入完成時展開；若它是另一關鍵字的前綴，則等待空白鍵。需要輔助使用權限。

# saved.editor.new
source: 新建片段
ar: مقتطف جديد
de: Neuer Textbaustein
en: New Snippet
es: Nuevo fragmento
fr: Nouvel extrait
ja: 新規スニペット
ko: 새 스니펫
pt: Novo trecho
ru: Новый фрагмент
tr: Yeni Parçacık
zh_hant: 新增片段

# saved.editor.preview
source: 预览
ar: معاينة
de: Vorschau
en: Preview
es: Vista previa
fr: Aperçu
ja: プレビュー
ko: 미리보기
pt: Pré-visualização
ru: Предпросмотр
tr: Önizleme
zh_hant: 預覽

# saved.editor.tags
source: 标签，以逗号分隔
ar: وسوم مفصولة بفواصل
de: Tags, durch Kommas getrennt
en: Tags, separated by commas
es: Etiquetas separadas por comas
fr: Étiquettes séparées par des virgules
ja: タグ（カンマ区切り）
ko: 태그(쉼표로 구분)
pt: Etiquetas separadas por vírgulas
ru: Теги через запятую
tr: Etiketler, virgülle ayrılır
zh_hant: 標籤，以逗號分隔

# saved.editor.title
source: 名称
ar: الاسم
de: Name
en: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt: Nome
ru: Название
tr: Ad
zh_hant: 名稱

# saved.editor.variable
source: 插入变量
ar: إدراج متغير
de: Variable einsetzen
en: Insert Variable
es: Insertar variable
fr: Insérer une variable
ja: 変数を挿入
ko: 변수 삽입
pt: Inserir variável
ru: Вставить переменную
tr: Değişken Ekle
zh_hant: 插入變數

# saved.error.duplicateKeyword
source: 关键词 %@ 已分配给另一个片段。
ar: الكلمة %@ معيّنة بالفعل لمقتطف آخر.
de: Das Kürzel %@ ist bereits einem anderen Textbaustein zugewiesen.
en: The keyword %@ is already assigned to another snippet.
es: La palabra clave %@ ya está asignada a otro fragmento.
fr: Le mot-clé %@ est déjà attribué à un autre extrait.
ja: キーワード %@ は別のスニペットに割り当てられています。
ko: 키워드 %@은(는) 다른 스니펫에 이미 지정되어 있습니다.
pt: A palavra-chave %@ já está atribuída a outro trecho.
ru: Ключевое слово %@ уже назначено другому фрагменту.
tr: %@ anahtar sözcüğü zaten başka bir parçacığa atanmış.
zh_hant: 關鍵字 %@ 已指派給另一個片段。

# saved.error.invalidMacroSyntax
source: 片段包含无效的变量表达式。
ar: يحتوي المقتطف على تعبير متغير غير صالح.
de: Das Snippet enthält einen ungültigen Variablenausdruck.
en: The snippet contains an invalid variable expression.
es: El fragmento contiene una expresión de variable no válida.
fr: L’extrait contient une expression de variable non valide.
ja: スニペットに無効な変数式が含まれています。
ko: 스니펫에 잘못된 변수 표현식이 있습니다.
pt: O trecho contém uma expressão de variável inválida.
ru: Сниппет содержит недопустимое выражение переменной.
tr: Parçacık geçersiz bir değişken ifadesi içeriyor.
zh_hant: 片段包含無效的變數運算式。

# saved.error.invalidDateFormat
source: 片段包含无效的日期或时间格式。
ar: يحتوي المقتطف على تنسيق تاريخ أو وقت غير صالح.
de: Der Textbaustein enthält ein ungültiges Datums- oder Zeitformat.
en: The snippet contains an invalid date or time format.
es: El fragmento contiene un formato de fecha u hora no válido.
fr: L’extrait contient un format de date ou d’heure non valide.
ja: スニペットに無効な日付または時刻の形式があります。
ko: 스니펫에 잘못된 날짜 또는 시간 형식이 있습니다.
pt: O trecho contém um formato de data ou hora inválido.
ru: Фрагмент содержит недопустимый формат даты или времени.
tr: Parçacık geçersiz bir tarih veya saat biçimi içeriyor.
zh_hant: 片段包含無效的日期或時間格式。

# saved.error.invalidKeyword
source: 关键词不能包含空格或换行符。
ar: لا يمكن أن تحتوي الكلمة على مسافات أو فواصل أسطر.
de: Ein Kürzel darf keine Leerzeichen oder Zeilenumbrüche enthalten.
en: A keyword cannot contain spaces or line breaks.
es: Una palabra clave no puede contener espacios ni saltos de línea.
fr: Un mot-clé ne peut pas contenir d’espaces ni de sauts de ligne.
ja: キーワードに空白や改行は使用できません。
ko: 키워드에는 공백이나 줄바꿈을 사용할 수 없습니다.
pt: Uma palavra-chave não pode conter espaços nem quebras de linha.
ru: Ключевое слово не может содержать пробелы или переносы строк.
tr: Bir anahtar sözcük boşluk veya satır sonu içeremez.
zh_hant: 關鍵字不能包含空格或換行符號。

# saved.error.keywordCacheFull
source: 已启用关键词的片段总计不能超过 %@。
ar: لا يمكن أن يتجاوز إجمالي المقتطفات ذات الكلمات المفتاحية %@.
de: Textbausteine mit Kürzel dürfen insgesamt %@ nicht überschreiten.
en: Keyword-enabled snippets cannot exceed %@ in total.
es: Los fragmentos con palabra clave no pueden superar %@ en total.
fr: Les extraits avec mot-clé ne peuvent pas dépasser %@ au total.
ja: キーワード付きスニペットの合計サイズは %@ を超えられません。
ko: 키워드가 지정된 스니펫은 총 %@을(를) 초과할 수 없습니다.
pt: Os trechos com palavra-chave não podem exceder %@ no total.
ru: Общий размер фрагментов с ключевыми словами не может превышать %@.
tr: Anahtar sözcüklü parçacıklar toplamda %@ boyutunu aşamaz.
zh_hant: 已啟用關鍵字的片段總計不能超過 %@。

# saved.error.multipleCursorMarkers
source: 片段只能包含一个光标标记。
ar: يمكن أن يحتوي المقتطف على علامة مؤشر واحدة فقط.
de: Ein Textbaustein darf nur eine Einfügemarke enthalten.
en: A snippet can contain only one cursor marker.
es: Un fragmento solo puede contener un marcador de cursor.
fr: Un extrait ne peut contenir qu’un seul repère de curseur.
ja: スニペットに挿入位置マーカーは1つだけ使用できます。
ko: 스니펫에는 커서 표시를 하나만 사용할 수 있습니다.
pt: Um trecho pode conter apenas um marcador de cursor.
ru: Фрагмент может содержать только один маркер курсора.
tr: Bir parçacık yalnızca bir imleç işareti içerebilir.
zh_hant: 片段只能包含一個游標標記。
